; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v8 ?v12)
             (pred_11 ?v7 ?v6)
             (pred_12 ?v8 ?v6)
             (pred_10 ?v11 ?v8 )
	     (pred_3 ?v8)
             (pred_6 ?v9)
             (pred_7 ?v7)
             (pred_1 ?v6)
             (pred_2 ?v8)
             (pred_4 ?v7)
             (pred_9 ?v8)
             (pred_8 ))



(:action op_4
:parameters (?v1 ?v10 ?v4 ?v5)
:precondition (and (pred_6 ?v1) (pred_6 ?v10) (pred_7 ?v4) (pred_1 ?v5)
          (pred_5 ?v1 ?v10) (pred_11 ?v4 ?v5)
                   (pred_12 ?v10 ?v5) (pred_3 ?v1) 
                   (pred_2 ?v10) (pred_4 ?v4))
:effect (and  (pred_9 ?v10) (not (pred_2 ?v10))))


(:action op_5
:parameters (?v1 ?v3)
:precondition (and (pred_6 ?v1) (pred_6 ?v3)
               (pred_3 ?v1) (pred_5 ?v1 ?v3) (pred_9 ?v3))
:effect (and (pred_3 ?v3) (not (pred_3 ?v1))))

(:action op_2
:parameters (?v1 ?v4)
:precondition (and (pred_6 ?v1) (pred_7 ?v4) 
                  (pred_3 ?v1) (pred_10 ?v4 ?v1) (pred_8 ))
:effect (and (pred_4 ?v4)
   (not (pred_10 ?v4 ?v1)) (not (pred_8 ))))


(:action op_3
:parameters (?v1 ?v2 ?v13)
:precondition (and (pred_6 ?v1) (pred_7 ?v2) (pred_7 ?v13)
                  (pred_3 ?v1) (pred_4 ?v13) (pred_10 ?v2 ?v1))
:effect (and (pred_4 ?v2) (pred_10 ?v13 ?v1)
        (not (pred_4 ?v13)) (not (pred_10 ?v2 ?v1))))

(:action op_1
:parameters (?v1 ?v4)
:precondition (and (pred_6 ?v1) (pred_7 ?v4) 
                  (pred_3 ?v1) (pred_4 ?v4))
:effect (and (pred_8 ) (pred_10 ?v4 ?v1) (not (pred_4 ?v4)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_20 obj_04 obj_28 obj_07 obj_23 obj_02 obj_12 obj_16 obj_10 obj_19 obj_25 obj_13 obj_17 obj_26 obj_09 obj_11 obj_22 obj_15 obj_29 obj_06 obj_24 obj_21 obj_01 obj_27
    obj_30 obj_05
    obj_08 obj_14 obj_18
    )

    (:init
       (pred_8)

       (pred_6 obj_03)
       (pred_6 obj_20)
       (pred_6 obj_04)
       (pred_6 obj_28)
       (pred_6 obj_07)
       (pred_6 obj_23)
       (pred_6 obj_02)
       (pred_6 obj_12)
       (pred_6 obj_16)
       (pred_6 obj_10)
       (pred_6 obj_19)
       (pred_6 obj_25)
       (pred_6 obj_13)
       (pred_6 obj_17)
       (pred_6 obj_26)
       (pred_6 obj_09)
       (pred_6 obj_11)
       (pred_6 obj_22)
       (pred_6 obj_15)
       (pred_6 obj_29)
       (pred_6 obj_06)
       (pred_6 obj_24)
       (pred_6 obj_21)
       (pred_6 obj_01)
       (pred_6 obj_27)
       (pred_1 obj_30)
       (pred_1 obj_05)
       (pred_7 obj_08)
       (pred_7 obj_14)
       (pred_7 obj_18)

       (pred_5 obj_03 obj_23)
       (pred_5 obj_03 obj_20)
       (pred_5 obj_20 obj_02)
       (pred_5 obj_20 obj_04)
       (pred_5 obj_20 obj_03)
       (pred_5 obj_04 obj_12)
       (pred_5 obj_04 obj_28)
       (pred_5 obj_04 obj_20)
       (pred_5 obj_28 obj_16)
       (pred_5 obj_28 obj_07)
       (pred_5 obj_28 obj_04)
       (pred_5 obj_07 obj_10)
       (pred_5 obj_07 obj_28)
       (pred_5 obj_23 obj_19)
       (pred_5 obj_23 obj_02)
       (pred_5 obj_23 obj_03)
       (pred_5 obj_02 obj_25)
       (pred_5 obj_02 obj_12)
       (pred_5 obj_02 obj_20)
       (pred_5 obj_02 obj_23)
       (pred_5 obj_12 obj_13)
       (pred_5 obj_12 obj_16)
       (pred_5 obj_12 obj_04)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_16 obj_17)
       (pred_5 obj_16 obj_10)
       (pred_5 obj_16 obj_28)
       (pred_5 obj_16 obj_12)
       (pred_5 obj_10 obj_26)
       (pred_5 obj_10 obj_07)
       (pred_5 obj_10 obj_16)
       (pred_5 obj_19 obj_09)
       (pred_5 obj_19 obj_25)
       (pred_5 obj_19 obj_23)
       (pred_5 obj_25 obj_11)
       (pred_5 obj_25 obj_13)
       (pred_5 obj_25 obj_02)
       (pred_5 obj_25 obj_19)
       (pred_5 obj_13 obj_22)
       (pred_5 obj_13 obj_17)
       (pred_5 obj_13 obj_12)
       (pred_5 obj_13 obj_25)
       (pred_5 obj_17 obj_15)
       (pred_5 obj_17 obj_26)
       (pred_5 obj_17 obj_16)
       (pred_5 obj_17 obj_13)
       (pred_5 obj_26 obj_29)
       (pred_5 obj_26 obj_10)
       (pred_5 obj_26 obj_17)
       (pred_5 obj_09 obj_06)
       (pred_5 obj_09 obj_11)
       (pred_5 obj_09 obj_19)
       (pred_5 obj_11 obj_24)
       (pred_5 obj_11 obj_22)
       (pred_5 obj_11 obj_25)
       (pred_5 obj_11 obj_09)
       (pred_5 obj_22 obj_21)
       (pred_5 obj_22 obj_15)
       (pred_5 obj_22 obj_13)
       (pred_5 obj_22 obj_11)
       (pred_5 obj_15 obj_01)
       (pred_5 obj_15 obj_29)
       (pred_5 obj_15 obj_17)
       (pred_5 obj_15 obj_22)
       (pred_5 obj_29 obj_27)
       (pred_5 obj_29 obj_26)
       (pred_5 obj_29 obj_15)
       (pred_5 obj_06 obj_24)
       (pred_5 obj_06 obj_09)
       (pred_5 obj_24 obj_21)
       (pred_5 obj_24 obj_11)
       (pred_5 obj_24 obj_06)
       (pred_5 obj_21 obj_01)
       (pred_5 obj_21 obj_22)
       (pred_5 obj_21 obj_24)
       (pred_5 obj_01 obj_27)
       (pred_5 obj_01 obj_15)
       (pred_5 obj_01 obj_21)
       (pred_5 obj_27 obj_29)
       (pred_5 obj_27 obj_01)
       (pred_2 obj_07)
       (pred_2 obj_13)
       (pred_2 obj_17)
       (pred_12  obj_07 obj_30)
       (pred_12  obj_13 obj_05)
       (pred_12  obj_17 obj_30)
       (pred_9 obj_03)
       (pred_9 obj_20)
       (pred_9 obj_04)
       (pred_9 obj_28)
       (pred_9 obj_23)
       (pred_9 obj_02)
       (pred_9 obj_12)
       (pred_9 obj_16)
       (pred_9 obj_10)
       (pred_9 obj_19)
       (pred_9 obj_25)
       (pred_9 obj_26)
       (pred_9 obj_09)
       (pred_9 obj_11)
       (pred_9 obj_22)
       (pred_9 obj_15)
       (pred_9 obj_29)
       (pred_9 obj_06)
       (pred_9 obj_24)
       (pred_9 obj_21)
       (pred_9 obj_01)
       (pred_9 obj_27)

       (pred_11  obj_08 obj_30)
       (pred_11  obj_14 obj_05)
       (pred_11  obj_18 obj_30)
       (pred_10 obj_08 obj_25)
       (pred_10 obj_14 obj_12)
       (pred_10 obj_18 obj_10)
       (pred_3 obj_11)
    )

    (:goal (and
       (pred_10 obj_14 obj_22)
       (pred_10 obj_18 obj_09)
    ))
(:constraints
  (always (not (pred_3 obj_13)))
)
)

; plan
1. (op_5 obj_11 obj_22)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_22)
   goals met: 0 of 2
2. (op_5 obj_22 obj_15)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_15)
   goals met: 0 of 2
3. (op_5 obj_15 obj_29)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_29)
   goals met: 0 of 2
4. (op_5 obj_29 obj_26)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_26)
   goals met: 0 of 2
5. (op_5 obj_26 obj_10)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_10)
   goals met: 0 of 2
6. (op_2 obj_10 obj_18)
   deleted: (pred_10 obj_18 obj_10) (pred_8)
   added: (pred_4 obj_18)
   goals met: 0 of 2
7. (op_5 obj_10 obj_16)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_16)
   goals met: 0 of 2
8. (op_5 obj_16 obj_12)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_12)
   goals met: 0 of 2
9. (op_3 obj_12 obj_14 obj_18)
   deleted: (pred_4 obj_18) (pred_10 obj_14 obj_12)
   added: (pred_4 obj_14) (pred_10 obj_18 obj_12)
   goals met: 0 of 2
10. (op_4 obj_12 obj_13 obj_14 obj_05)
   deleted: (pred_2 obj_13)
   added: (pred_9 obj_13)
   goals met: 0 of 2
11. (op_5 obj_12 obj_02)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_02)
   goals met: 0 of 2
12. (op_5 obj_02 obj_23)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_23)
   goals met: 0 of 2
13. (op_5 obj_23 obj_19)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_19)
   goals met: 0 of 2
14. (op_5 obj_19 obj_09)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_09)
   goals met: 0 of 2
15. (op_5 obj_09 obj_11)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_11)
   goals met: 0 of 2
16. (op_5 obj_11 obj_22)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_22)
   goals met: 0 of 2
17. (op_1 obj_22 obj_14)
   deleted: (pred_4 obj_14)
   added: (pred_8) (pred_10 obj_14 obj_22)
   goals met: 1 of 2
18. (op_5 obj_22 obj_11)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_11)
   goals met: 1 of 2
19. (op_5 obj_11 obj_25)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_25)
   goals met: 1 of 2
20. (op_5 obj_25 obj_02)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_02)
   goals met: 1 of 2
21. (op_5 obj_02 obj_12)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_12)
   goals met: 1 of 2
22. (op_2 obj_12 obj_18)
   deleted: (pred_10 obj_18 obj_12) (pred_8)
   added: (pred_4 obj_18)
   goals met: 1 of 2
23. (op_5 obj_12 obj_02)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_02)
   goals met: 1 of 2
24. (op_5 obj_02 obj_23)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_23)
   goals met: 1 of 2
25. (op_5 obj_23 obj_19)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_19)
   goals met: 1 of 2
26. (op_5 obj_19 obj_09)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_09)
   goals met: 1 of 2
27. (op_1 obj_09 obj_18)
   deleted: (pred_4 obj_18)
   added: (pred_8) (pred_10 obj_18 obj_09)
   goals met: 2 of 2
